Revit 2024 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionForbiddenElementInGroup Property
 Fabrication element can not be a group member.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StructuralConnectionForbiddenElementInGroup { get; }
Visual Basic
Public Shared ReadOnly Property StructuralConnectionForbiddenElementInGroup As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StructuralConnectionForbiddenElementInGroup {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace